{"format": "layers-model", "generatedBy": null, "convertedBy": "TensorFlow.js Converter v2.3.0", "modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "Conv1/kernel", "shape": [3, 3, 3, 16], "dtype": "float32"}, {"name": "bn_Conv1/gamma", "shape": [16], "dtype": "float32"}, {"name": "bn_Conv1/beta", "shape": [16], "dtype": "float32"}, {"name": "bn_Conv1/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "bn_Conv1/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "expanded_conv_depthwise/depthwise_kernel", "shape": [3, 3, 16, 1], "dtype": "float32"}, {"name": "expanded_conv_depthwise_BN/gamma", "shape": [16], "dtype": "float32"}, {"name": "expanded_conv_depthwise_BN/beta", "shape": [16], "dtype": "float32"}, {"name": "expanded_conv_depthwise_BN/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "expanded_conv_depthwise_BN/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "expanded_conv_project/kernel", "shape": [1, 1, 16, 8], "dtype": "float32"}, {"name": "expanded_conv_project_BN/gamma", "shape": [8], "dtype": "float32"}, {"name": "expanded_conv_project_BN/beta", "shape": [8], "dtype": "float32"}, {"name": "expanded_conv_project_BN/moving_mean", "shape": [8], "dtype": "float32"}, {"name": "expanded_conv_project_BN/moving_variance", "shape": [8], "dtype": "float32"}, {"name": "block_1_expand/kernel", "shape": [1, 1, 8, 48], "dtype": "float32"}, {"name": "block_1_expand_BN/gamma", "shape": [48], "dtype": "float32"}, {"name": "block_1_expand_BN/beta", "shape": [48], "dtype": "float32"}, {"name": "block_1_expand_BN/moving_mean", "shape": [48], "dtype": "float32"}, {"name": "block_1_expand_BN/moving_variance", "shape": [48], "dtype": "float32"}, {"name": "block_1_depthwise/depthwise_kernel", "shape": [3, 3, 48, 1], "dtype": "float32"}, {"name": "block_1_depthwise_BN/gamma", "shape": [48], "dtype": "float32"}, {"name": "block_1_depthwise_BN/beta", "shape": [48], "dtype": "float32"}, {"name": "block_1_depthwise_BN/moving_mean", "shape": [48], "dtype": "float32"}, {"name": "block_1_depthwise_BN/moving_variance", "shape": [48], "dtype": "float32"}, {"name": "block_1_project/kernel", "shape": [1, 1, 48, 16], "dtype": "float32"}, {"name": "block_1_project_BN/gamma", "shape": [16], "dtype": "float32"}, {"name": "block_1_project_BN/beta", "shape": [16], "dtype": "float32"}, {"name": "block_1_project_BN/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "block_1_project_BN/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "block_2_expand/kernel", "shape": [1, 1, 16, 96], "dtype": "float32"}, {"name": "block_2_expand_BN/gamma", "shape": [96], "dtype": "float32"}, {"name": "block_2_expand_BN/beta", "shape": [96], "dtype": "float32"}, {"name": "block_2_expand_BN/moving_mean", "shape": [96], "dtype": "float32"}, {"name": "block_2_expand_BN/moving_variance", "shape": [96], "dtype": "float32"}, {"name": "block_2_depthwise/depthwise_kernel", "shape": [3, 3, 96, 1], "dtype": "float32"}, {"name": "block_2_depthwise_BN/gamma", "shape": [96], "dtype": "float32"}, {"name": "block_2_depthwise_BN/beta", "shape": [96], "dtype": "float32"}, {"name": "block_2_depthwise_BN/moving_mean", "shape": [96], "dtype": "float32"}, {"name": "block_2_depthwise_BN/moving_variance", "shape": [96], "dtype": "float32"}, {"name": "block_2_project/kernel", "shape": [1, 1, 96, 16], "dtype": "float32"}, {"name": "block_2_project_BN/gamma", "shape": [16], "dtype": "float32"}, {"name": "block_2_project_BN/beta", "shape": [16], "dtype": "float32"}, {"name": "block_2_project_BN/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "block_2_project_BN/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "block_3_expand/kernel", "shape": [1, 1, 16, 96], "dtype": "float32"}, {"name": "block_3_expand_BN/gamma", "shape": [96], "dtype": "float32"}, {"name": "block_3_expand_BN/beta", "shape": [96], "dtype": "float32"}, {"name": "block_3_expand_BN/moving_mean", "shape": [96], "dtype": "float32"}, {"name": "block_3_expand_BN/moving_variance", "shape": [96], "dtype": "float32"}, {"name": "block_3_depthwise/depthwise_kernel", "shape": [3, 3, 96, 1], "dtype": "float32"}, {"name": "block_3_depthwise_BN/gamma", "shape": [96], "dtype": "float32"}, {"name": "block_3_depthwise_BN/beta", "shape": [96], "dtype": "float32"}, {"name": "block_3_depthwise_BN/moving_mean", "shape": [96], "dtype": "float32"}, {"name": "block_3_depthwise_BN/moving_variance", "shape": [96], "dtype": "float32"}, {"name": "block_3_project/kernel", "shape": [1, 1, 96, 16], "dtype": "float32"}, {"name": "block_3_project_BN/gamma", "shape": [16], "dtype": "float32"}, {"name": "block_3_project_BN/beta", "shape": [16], "dtype": "float32"}, {"name": "block_3_project_BN/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "block_3_project_BN/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "block_4_expand/kernel", "shape": [1, 1, 16, 96], "dtype": "float32"}, {"name": "block_4_expand_BN/gamma", "shape": [96], "dtype": "float32"}, {"name": "block_4_expand_BN/beta", "shape": [96], "dtype": "float32"}, {"name": "block_4_expand_BN/moving_mean", "shape": [96], "dtype": "float32"}, {"name": "block_4_expand_BN/moving_variance", "shape": [96], "dtype": "float32"}, {"name": "block_4_depthwise/depthwise_kernel", "shape": [3, 3, 96, 1], "dtype": "float32"}, {"name": "block_4_depthwise_BN/gamma", "shape": [96], "dtype": "float32"}, {"name": "block_4_depthwise_BN/beta", "shape": [96], "dtype": "float32"}, {"name": "block_4_depthwise_BN/moving_mean", "shape": [96], "dtype": "float32"}, {"name": "block_4_depthwise_BN/moving_variance", "shape": [96], "dtype": "float32"}, {"name": "block_4_project/kernel", "shape": [1, 1, 96, 16], "dtype": "float32"}, {"name": "block_4_project_BN/gamma", "shape": [16], "dtype": "float32"}, {"name": "block_4_project_BN/beta", "shape": [16], "dtype": "float32"}, {"name": "block_4_project_BN/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "block_4_project_BN/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "block_5_expand/kernel", "shape": [1, 1, 16, 96], "dtype": "float32"}, {"name": "block_5_expand_BN/gamma", "shape": [96], "dtype": "float32"}, {"name": "block_5_expand_BN/beta", "shape": [96], "dtype": "float32"}, {"name": "block_5_expand_BN/moving_mean", "shape": [96], "dtype": "float32"}, {"name": "block_5_expand_BN/moving_variance", "shape": [96], "dtype": "float32"}, {"name": "block_5_depthwise/depthwise_kernel", "shape": [3, 3, 96, 1], "dtype": "float32"}, {"name": "block_5_depthwise_BN/gamma", "shape": [96], "dtype": "float32"}, {"name": "block_5_depthwise_BN/beta", "shape": [96], "dtype": "float32"}, {"name": "block_5_depthwise_BN/moving_mean", "shape": [96], "dtype": "float32"}, {"name": "block_5_depthwise_BN/moving_variance", "shape": [96], "dtype": "float32"}, {"name": "block_5_project/kernel", "shape": [1, 1, 96, 16], "dtype": "float32"}, {"name": "block_5_project_BN/gamma", "shape": [16], "dtype": "float32"}, {"name": "block_5_project_BN/beta", "shape": [16], "dtype": "float32"}, {"name": "block_5_project_BN/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "block_5_project_BN/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "block_6_expand/kernel", "shape": [1, 1, 16, 96], "dtype": "float32"}, {"name": "block_6_expand_BN/gamma", "shape": [96], "dtype": "float32"}, {"name": "block_6_expand_BN/beta", "shape": [96], "dtype": "float32"}, {"name": "block_6_expand_BN/moving_mean", "shape": [96], "dtype": "float32"}, {"name": "block_6_expand_BN/moving_variance", "shape": [96], "dtype": "float32"}, {"name": "block_6_depthwise/depthwise_kernel", "shape": [3, 3, 96, 1], "dtype": "float32"}, {"name": "block_6_depthwise_BN/gamma", "shape": [96], "dtype": "float32"}, {"name": "block_6_depthwise_BN/beta", "shape": [96], "dtype": "float32"}, {"name": "block_6_depthwise_BN/moving_mean", "shape": [96], "dtype": "float32"}, {"name": "block_6_depthwise_BN/moving_variance", "shape": [96], "dtype": "float32"}, {"name": "block_6_project/kernel", "shape": [1, 1, 96, 32], "dtype": "float32"}, {"name": "block_6_project_BN/gamma", "shape": [32], "dtype": "float32"}, {"name": "block_6_project_BN/beta", "shape": [32], "dtype": "float32"}, {"name": "block_6_project_BN/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "block_6_project_BN/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "block_7_expand/kernel", "shape": [1, 1, 32, 192], "dtype": "float32"}, {"name": "block_7_expand_BN/gamma", "shape": [192], "dtype": "float32"}, {"name": "block_7_expand_BN/beta", "shape": [192], "dtype": "float32"}, {"name": "block_7_expand_BN/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "block_7_expand_BN/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "block_7_depthwise/depthwise_kernel", "shape": [3, 3, 192, 1], "dtype": "float32"}, {"name": "block_7_depthwise_BN/gamma", "shape": [192], "dtype": "float32"}, {"name": "block_7_depthwise_BN/beta", "shape": [192], "dtype": "float32"}, {"name": "block_7_depthwise_BN/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "block_7_depthwise_BN/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "block_7_project/kernel", "shape": [1, 1, 192, 32], "dtype": "float32"}, {"name": "block_7_project_BN/gamma", "shape": [32], "dtype": "float32"}, {"name": "block_7_project_BN/beta", "shape": [32], "dtype": "float32"}, {"name": "block_7_project_BN/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "block_7_project_BN/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "block_8_expand/kernel", "shape": [1, 1, 32, 192], "dtype": "float32"}, {"name": "block_8_expand_BN/gamma", "shape": [192], "dtype": "float32"}, {"name": "block_8_expand_BN/beta", "shape": [192], "dtype": "float32"}, {"name": "block_8_expand_BN/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "block_8_expand_BN/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "block_8_depthwise/depthwise_kernel", "shape": [3, 3, 192, 1], "dtype": "float32"}, {"name": "block_8_depthwise_BN/gamma", "shape": [192], "dtype": "float32"}, {"name": "block_8_depthwise_BN/beta", "shape": [192], "dtype": "float32"}, {"name": "block_8_depthwise_BN/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "block_8_depthwise_BN/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "block_8_project/kernel", "shape": [1, 1, 192, 32], "dtype": "float32"}, {"name": "block_8_project_BN/gamma", "shape": [32], "dtype": "float32"}, {"name": "block_8_project_BN/beta", "shape": [32], "dtype": "float32"}, {"name": "block_8_project_BN/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "block_8_project_BN/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "block_9_expand/kernel", "shape": [1, 1, 32, 192], "dtype": "float32"}, {"name": "block_9_expand_BN/gamma", "shape": [192], "dtype": "float32"}, {"name": "block_9_expand_BN/beta", "shape": [192], "dtype": "float32"}, {"name": "block_9_expand_BN/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "block_9_expand_BN/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "block_9_depthwise/depthwise_kernel", "shape": [3, 3, 192, 1], "dtype": "float32"}, {"name": "block_9_depthwise_BN/gamma", "shape": [192], "dtype": "float32"}, {"name": "block_9_depthwise_BN/beta", "shape": [192], "dtype": "float32"}, {"name": "block_9_depthwise_BN/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "block_9_depthwise_BN/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "block_9_project/kernel", "shape": [1, 1, 192, 32], "dtype": "float32"}, {"name": "block_9_project_BN/gamma", "shape": [32], "dtype": "float32"}, {"name": "block_9_project_BN/beta", "shape": [32], "dtype": "float32"}, {"name": "block_9_project_BN/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "block_9_project_BN/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "block_10_expand/kernel", "shape": [1, 1, 32, 192], "dtype": "float32"}, {"name": "block_10_expand_BN/gamma", "shape": [192], "dtype": "float32"}, {"name": "block_10_expand_BN/beta", "shape": [192], "dtype": "float32"}, {"name": "block_10_expand_BN/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "block_10_expand_BN/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "block_10_depthwise/depthwise_kernel", "shape": [3, 3, 192, 1], "dtype": "float32"}, {"name": "block_10_depthwise_BN/gamma", "shape": [192], "dtype": "float32"}, {"name": "block_10_depthwise_BN/beta", "shape": [192], "dtype": "float32"}, {"name": "block_10_depthwise_BN/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "block_10_depthwise_BN/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "block_10_project/kernel", "shape": [1, 1, 192, 48], "dtype": "float32"}, {"name": "block_10_project_BN/gamma", "shape": [48], "dtype": "float32"}, {"name": "block_10_project_BN/beta", "shape": [48], "dtype": "float32"}, {"name": "block_10_project_BN/moving_mean", "shape": [48], "dtype": "float32"}, {"name": "block_10_project_BN/moving_variance", "shape": [48], "dtype": "float32"}, {"name": "block_11_expand/kernel", "shape": [1, 1, 48, 288], "dtype": "float32"}, {"name": "block_11_expand_BN/gamma", "shape": [288], "dtype": "float32"}, {"name": "block_11_expand_BN/beta", "shape": [288], "dtype": "float32"}, {"name": "block_11_expand_BN/moving_mean", "shape": [288], "dtype": "float32"}, {"name": "block_11_expand_BN/moving_variance", "shape": [288], "dtype": "float32"}, {"name": "block_11_depthwise/depthwise_kernel", "shape": [3, 3, 288, 1], "dtype": "float32"}, {"name": "block_11_depthwise_BN/gamma", "shape": [288], "dtype": "float32"}, {"name": "block_11_depthwise_BN/beta", "shape": [288], "dtype": "float32"}, {"name": "block_11_depthwise_BN/moving_mean", "shape": [288], "dtype": "float32"}, {"name": "block_11_depthwise_BN/moving_variance", "shape": [288], "dtype": "float32"}, {"name": "block_11_project/kernel", "shape": [1, 1, 288, 48], "dtype": "float32"}, {"name": "block_11_project_BN/gamma", "shape": [48], "dtype": "float32"}, {"name": "block_11_project_BN/beta", "shape": [48], "dtype": "float32"}, {"name": "block_11_project_BN/moving_mean", "shape": [48], "dtype": "float32"}, {"name": "block_11_project_BN/moving_variance", "shape": [48], "dtype": "float32"}, {"name": "block_12_expand/kernel", "shape": [1, 1, 48, 288], "dtype": "float32"}, {"name": "block_12_expand_BN/gamma", "shape": [288], "dtype": "float32"}, {"name": "block_12_expand_BN/beta", "shape": [288], "dtype": "float32"}, {"name": "block_12_expand_BN/moving_mean", "shape": [288], "dtype": "float32"}, {"name": "block_12_expand_BN/moving_variance", "shape": [288], "dtype": "float32"}, {"name": "block_12_depthwise/depthwise_kernel", "shape": [3, 3, 288, 1], "dtype": "float32"}, {"name": "block_12_depthwise_BN/gamma", "shape": [288], "dtype": "float32"}, {"name": "block_12_depthwise_BN/beta", "shape": [288], "dtype": "float32"}, {"name": "block_12_depthwise_BN/moving_mean", "shape": [288], "dtype": "float32"}, {"name": "block_12_depthwise_BN/moving_variance", "shape": [288], "dtype": "float32"}, {"name": "block_12_project/kernel", "shape": [1, 1, 288, 48], "dtype": "float32"}, {"name": "block_12_project_BN/gamma", "shape": [48], "dtype": "float32"}, {"name": "block_12_project_BN/beta", "shape": [48], "dtype": "float32"}, {"name": "block_12_project_BN/moving_mean", "shape": [48], "dtype": "float32"}, {"name": "block_12_project_BN/moving_variance", "shape": [48], "dtype": "float32"}, {"name": "block_13_expand/kernel", "shape": [1, 1, 48, 288], "dtype": "float32"}, {"name": "block_13_expand_BN/gamma", "shape": [288], "dtype": "float32"}, {"name": "block_13_expand_BN/beta", "shape": [288], "dtype": "float32"}, {"name": "block_13_expand_BN/moving_mean", "shape": [288], "dtype": "float32"}, {"name": "block_13_expand_BN/moving_variance", "shape": [288], "dtype": "float32"}, {"name": "block_13_depthwise/depthwise_kernel", "shape": [3, 3, 288, 1], "dtype": "float32"}, {"name": "block_13_depthwise_BN/gamma", "shape": [288], "dtype": "float32"}, {"name": "block_13_depthwise_BN/beta", "shape": [288], "dtype": "float32"}, {"name": "block_13_depthwise_BN/moving_mean", "shape": [288], "dtype": "float32"}, {"name": "block_13_depthwise_BN/moving_variance", "shape": [288], "dtype": "float32"}, {"name": "block_13_project/kernel", "shape": [1, 1, 288, 80], "dtype": "float32"}, {"name": "block_13_project_BN/gamma", "shape": [80], "dtype": "float32"}, {"name": "block_13_project_BN/beta", "shape": [80], "dtype": "float32"}, {"name": "block_13_project_BN/moving_mean", "shape": [80], "dtype": "float32"}, {"name": "block_13_project_BN/moving_variance", "shape": [80], "dtype": "float32"}, {"name": "block_14_expand/kernel", "shape": [1, 1, 80, 480], "dtype": "float32"}, {"name": "block_14_expand_BN/gamma", "shape": [480], "dtype": "float32"}, {"name": "block_14_expand_BN/beta", "shape": [480], "dtype": "float32"}, {"name": "block_14_expand_BN/moving_mean", "shape": [480], "dtype": "float32"}, {"name": "block_14_expand_BN/moving_variance", "shape": [480], "dtype": "float32"}, {"name": "block_14_depthwise/depthwise_kernel", "shape": [3, 3, 480, 1], "dtype": "float32"}, {"name": "block_14_depthwise_BN/gamma", "shape": [480], "dtype": "float32"}, {"name": "block_14_depthwise_BN/beta", "shape": [480], "dtype": "float32"}, {"name": "block_14_depthwise_BN/moving_mean", "shape": [480], "dtype": "float32"}, {"name": "block_14_depthwise_BN/moving_variance", "shape": [480], "dtype": "float32"}, {"name": "block_14_project/kernel", "shape": [1, 1, 480, 80], "dtype": "float32"}, {"name": "block_14_project_BN/gamma", "shape": [80], "dtype": "float32"}, {"name": "block_14_project_BN/beta", "shape": [80], "dtype": "float32"}, {"name": "block_14_project_BN/moving_mean", "shape": [80], "dtype": "float32"}, {"name": "block_14_project_BN/moving_variance", "shape": [80], "dtype": "float32"}, {"name": "block_15_expand/kernel", "shape": [1, 1, 80, 480], "dtype": "float32"}, {"name": "block_15_expand_BN/gamma", "shape": [480], "dtype": "float32"}, {"name": "block_15_expand_BN/beta", "shape": [480], "dtype": "float32"}, {"name": "block_15_expand_BN/moving_mean", "shape": [480], "dtype": "float32"}, {"name": "block_15_expand_BN/moving_variance", "shape": [480], "dtype": "float32"}, {"name": "block_15_depthwise/depthwise_kernel", "shape": [3, 3, 480, 1], "dtype": "float32"}, {"name": "block_15_depthwise_BN/gamma", "shape": [480], "dtype": "float32"}, {"name": "block_15_depthwise_BN/beta", "shape": [480], "dtype": "float32"}, {"name": "block_15_depthwise_BN/moving_mean", "shape": [480], "dtype": "float32"}, {"name": "block_15_depthwise_BN/moving_variance", "shape": [480], "dtype": "float32"}, {"name": "block_15_project/kernel", "shape": [1, 1, 480, 80], "dtype": "float32"}, {"name": "block_15_project_BN/gamma", "shape": [80], "dtype": "float32"}, {"name": "block_15_project_BN/beta", "shape": [80], "dtype": "float32"}, {"name": "block_15_project_BN/moving_mean", "shape": [80], "dtype": "float32"}, {"name": "block_15_project_BN/moving_variance", "shape": [80], "dtype": "float32"}, {"name": "block_16_expand/kernel", "shape": [1, 1, 80, 480], "dtype": "float32"}, {"name": "block_16_expand_BN/gamma", "shape": [480], "dtype": "float32"}, {"name": "block_16_expand_BN/beta", "shape": [480], "dtype": "float32"}, {"name": "block_16_expand_BN/moving_mean", "shape": [480], "dtype": "float32"}, {"name": "block_16_expand_BN/moving_variance", "shape": [480], "dtype": "float32"}, {"name": "block_16_depthwise/depthwise_kernel", "shape": [3, 3, 480, 1], "dtype": "float32"}, {"name": "block_16_depthwise_BN/gamma", "shape": [480], "dtype": "float32"}, {"name": "block_16_depthwise_BN/beta", "shape": [480], "dtype": "float32"}, {"name": "block_16_depthwise_BN/moving_mean", "shape": [480], "dtype": "float32"}, {"name": "block_16_depthwise_BN/moving_variance", "shape": [480], "dtype": "float32"}, {"name": "block_16_project/kernel", "shape": [1, 1, 480, 160], "dtype": "float32"}, {"name": "block_16_project_BN/gamma", "shape": [160], "dtype": "float32"}, {"name": "block_16_project_BN/beta", "shape": [160], "dtype": "float32"}, {"name": "block_16_project_BN/moving_mean", "shape": [160], "dtype": "float32"}, {"name": "block_16_project_BN/moving_variance", "shape": [160], "dtype": "float32"}, {"name": "Conv_1/kernel", "shape": [1, 1, 160, 1280], "dtype": "float32"}, {"name": "Conv_1_bn/gamma", "shape": [1280], "dtype": "float32"}, {"name": "Conv_1_bn/beta", "shape": [1280], "dtype": "float32"}, {"name": "Conv_1_bn/moving_mean", "shape": [1280], "dtype": "float32"}, {"name": "Conv_1_bn/moving_variance", "shape": [1280], "dtype": "float32"}, {"name": "upsample_1_dwconv/depthwise_kernel", "shape": [3, 3, 1568, 1], "dtype": "float32"}, {"name": "upsample_1_bn_1/gamma", "shape": [1568], "dtype": "float32"}, {"name": "upsample_1_bn_1/beta", "shape": [1568], "dtype": "float32"}, {"name": "upsample_1_bn_1/moving_mean", "shape": [1568], "dtype": "float32"}, {"name": "upsample_1_bn_1/moving_variance", "shape": [1568], "dtype": "float32"}, {"name": "upsample_1_pwconv/kernel", "shape": [1, 1, 1568, 128], "dtype": "float32"}, {"name": "upsample_1_bn_2/gamma", "shape": [128], "dtype": "float32"}, {"name": "upsample_1_bn_2/beta", "shape": [128], "dtype": "float32"}, {"name": "upsample_1_bn_2/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "upsample_1_bn_2/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "upsample_2_dwconv/depthwise_kernel", "shape": [3, 3, 224, 1], "dtype": "float32"}, {"name": "upsample_2_bn_1/gamma", "shape": [224], "dtype": "float32"}, {"name": "upsample_2_bn_1/beta", "shape": [224], "dtype": "float32"}, {"name": "upsample_2_bn_1/moving_mean", "shape": [224], "dtype": "float32"}, {"name": "upsample_2_bn_1/moving_variance", "shape": [224], "dtype": "float32"}, {"name": "upsample_2_pwconv/kernel", "shape": [1, 1, 224, 64], "dtype": "float32"}, {"name": "upsample_2_bn_2/gamma", "shape": [64], "dtype": "float32"}, {"name": "upsample_2_bn_2/beta", "shape": [64], "dtype": "float32"}, {"name": "upsample_2_bn_2/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "upsample_2_bn_2/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "upsample_3_dwconv/depthwise_kernel", "shape": [3, 3, 160, 1], "dtype": "float32"}, {"name": "upsample_3_bn_1/gamma", "shape": [160], "dtype": "float32"}, {"name": "upsample_3_bn_1/beta", "shape": [160], "dtype": "float32"}, {"name": "upsample_3_bn_1/moving_mean", "shape": [160], "dtype": "float32"}, {"name": "upsample_3_bn_1/moving_variance", "shape": [160], "dtype": "float32"}, {"name": "upsample_3_pwconv/kernel", "shape": [1, 1, 160, 42], "dtype": "float32"}, {"name": "upsample_3_bn_2/gamma", "shape": [42], "dtype": "float32"}, {"name": "upsample_3_bn_2/beta", "shape": [42], "dtype": "float32"}, {"name": "upsample_3_bn_2/moving_mean", "shape": [42], "dtype": "float32"}, {"name": "upsample_3_bn_2/moving_variance", "shape": [42], "dtype": "float32"}, {"name": "heatmaps_conv_1/kernel", "shape": [3, 3, 42, 32], "dtype": "float32"}, {"name": "heatmaps_bn/gamma", "shape": [32], "dtype": "float32"}, {"name": "heatmaps_bn/beta", "shape": [32], "dtype": "float32"}, {"name": "heatmaps_bn/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "heatmaps_bn/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "heatmaps_conv_2/kernel", "shape": [1, 1, 32, 1], "dtype": "float32"}, {"name": "heatmaps_conv_2/bias", "shape": [1], "dtype": "float32"}, {"name": "extents_conv_1/kernel", "shape": [3, 3, 42, 32], "dtype": "float32"}, {"name": "extents_conv_1/bias", "shape": [32], "dtype": "float32"}, {"name": "offsets_conv_1/kernel", "shape": [3, 3, 42, 32], "dtype": "float32"}, {"name": "offsets_conv_1/bias", "shape": [32], "dtype": "float32"}, {"name": "extents/kernel", "shape": [1, 1, 32, 2], "dtype": "float32"}, {"name": "extents/bias", "shape": [2], "dtype": "float32"}, {"name": "offsets/kernel", "shape": [1, 1, 32, 2], "dtype": "float32"}, {"name": "offsets/bias", "shape": [2], "dtype": "float32"}]}]}